src/logs/desempenho/cenario1/ack-2/log--2-20000-8.out
Topic to send: test-topic
Topic to acks: -2
Records: 80000
Size:20000
[18:21:54]    __________  ________________ 
[18:21:54]   /  _/ ___/ |/ /  _/_  __/ __/ 
[18:21:54]  _/ // (7 7    // /  / / / _/   
[18:21:54] /___/\___/_/|_/___/ /_/ /___/  
[18:21:54] 
[18:21:54] ver. 2.7.6#20190911-sha1:21f7ca41
[18:21:54] 2019 Copyright(C) Apache Software Foundation
[18:21:54] 
[18:21:54] Ignite documentation: http://ignite.apache.org
[18:21:54] 
[18:21:54] Quiet mode.
[18:21:54]   ^-- Logging by 'JavaLogger [quiet=true, config=null]'
[18:21:54]   ^-- To see **FULL** console log here add -DIGNITE_QUIET=false or "-v" to ignite.{sh|bat}
[18:21:54] 
[18:21:54] OS: Linux 5.0.0-38-generic amd64
[18:21:54] VM information: OpenJDK Runtime Environment 11.0.5+10-post-Ubuntu-0ubuntu1.119.04 Private Build OpenJDK 64-Bit Server VM 11.0.5+10-post-Ubuntu-0ubuntu1.119.04
[18:21:54] Please set system property '-Djava.net.preferIPv4Stack=true' to avoid possible problems in mixed environments.
[18:21:54] Initial heap size is 126MB (should be no less than 512MB, use -Xms512m -Xmx512m).
[18:21:54] Configured plugins:
[18:21:54]   ^-- None
[18:21:54] 
[18:21:54] Configured failure handler: [hnd=StopNodeOrHaltFailureHandler [tryStop=false, timeout=0, super=AbstractFailureHandler [ignoredFailureTypes=[SYSTEM_WORKER_BLOCKED, SYSTEM_CRITICAL_OPERATION_TIMEOUT]]]]
[18:21:54] Message queue limit is set to 0 which may lead to potential OOMEs when running cache operations in FULL_ASYNC or PRIMARY_SYNC modes due to message queues growth on sender and receiver sides.
[18:21:54] Security status [authentication=off, tls/ssl=off]
[18:21:55] REST protocols do not start on client node. To start the protocols on client node set '-DIGNITE_REST_START_ON_CLIENT=true' system property.
[18:21:57] Performance suggestions for grid  (fix if possible)
[18:21:57] To disable, set -DIGNITE_PERFORMANCE_SUGGESTIONS_DISABLED=true
[18:21:57]   ^-- Switch to the most recent 1.8 JVM version
[18:21:57]   ^-- Specify JVM heap max size (add '-Xmx<size>[g|G|m|M|k|K]' to JVM options)
[18:21:57]   ^-- Set max direct memory size if getting 'OOME: Direct buffer memory' (add '-XX:MaxDirectMemorySize=<size>[g|G|m|M|k|K]' to JVM options)
[18:21:57]   ^-- Disable processing of calls to System.gc() (add '-XX:+DisableExplicitGC' to JVM options)
[18:21:57] Refer to this page for more performance suggestions: https://apacheignite.readme.io/docs/jvm-and-system-tuning
[18:21:57] 
[18:21:57] To start Console Management & Monitoring run ignitevisorcmd.{sh|bat}
[18:21:57] 
[18:21:57] Ignite node started OK (id=983d058e)
[18:21:57] Topology snapshot [ver=60, locNode=983d058e, servers=1, clients=1, state=ACTIVE, CPUs=8, offheap=1.5GB, heap=3.9GB]
1328 records sent, 194,1 records/sec (3,70 MB/sec), 5,1 ms avg latency, 3552,0 ms max latency.
1276 records sent, 254,1 records/sec (4,85 MB/sec), 3,9 ms avg latency, 95,0 ms max latency.
1300 records sent, 258,2 records/sec (4,92 MB/sec), 3,8 ms avg latency, 92,0 ms max latency.
1300 records sent, 259,9 records/sec (4,96 MB/sec), 3,8 ms avg latency, 92,0 ms max latency.
1325 records sent, 262,6 records/sec (5,01 MB/sec), 3,8 ms avg latency, 91,0 ms max latency.
1300 records sent, 259,6 records/sec (4,95 MB/sec), 3,8 ms avg latency, 98,0 ms max latency.
1275 records sent, 253,4 records/sec (4,83 MB/sec), 3,9 ms avg latency, 95,0 ms max latency.
1325 records sent, 264,2 records/sec (5,04 MB/sec), 3,8 ms avg latency, 104,0 ms max latency.
1325 records sent, 262,6 records/sec (5,01 MB/sec), 3,8 ms avg latency, 90,0 ms max latency.
1325 records sent, 264,4 records/sec (5,04 MB/sec), 3,8 ms avg latency, 93,0 ms max latency.
1350 records sent, 266,0 records/sec (5,07 MB/sec), 3,7 ms avg latency, 91,0 ms max latency.
1350 records sent, 266,1 records/sec (5,08 MB/sec), 3,7 ms avg latency, 98,0 ms max latency.
1350 records sent, 265,7 records/sec (5,07 MB/sec), 3,7 ms avg latency, 91,0 ms max latency.
1325 records sent, 265,0 records/sec (5,05 MB/sec), 3,8 ms avg latency, 100,0 ms max latency.
1350 records sent, 266,8 records/sec (5,09 MB/sec), 3,7 ms avg latency, 90,0 ms max latency.
1350 records sent, 267,3 records/sec (5,10 MB/sec), 3,7 ms avg latency, 90,0 ms max latency.
1350 records sent, 267,5 records/sec (5,10 MB/sec), 3,7 ms avg latency, 91,0 ms max latency.
1350 records sent, 267,2 records/sec (5,10 MB/sec), 3,7 ms avg latency, 92,0 ms max latency.
1350 records sent, 266,7 records/sec (5,09 MB/sec), 3,7 ms avg latency, 93,0 ms max latency.
1350 records sent, 266,4 records/sec (5,08 MB/sec), 3,7 ms avg latency, 91,0 ms max latency.
1350 records sent, 267,0 records/sec (5,09 MB/sec), 3,7 ms avg latency, 92,0 ms max latency.
1350 records sent, 267,1 records/sec (5,09 MB/sec), 3,7 ms avg latency, 94,0 ms max latency.
1350 records sent, 266,9 records/sec (5,09 MB/sec), 3,7 ms avg latency, 91,0 ms max latency.
1350 records sent, 266,4 records/sec (5,08 MB/sec), 3,7 ms avg latency, 91,0 ms max latency.
1325 records sent, 263,3 records/sec (5,02 MB/sec), 3,8 ms avg latency, 93,0 ms max latency.
1350 records sent, 266,1 records/sec (5,08 MB/sec), 3,7 ms avg latency, 92,0 ms max latency.
1350 records sent, 266,8 records/sec (5,09 MB/sec), 3,7 ms avg latency, 93,0 ms max latency.
1350 records sent, 267,3 records/sec (5,10 MB/sec), 3,7 ms avg latency, 89,0 ms max latency.
1350 records sent, 266,7 records/sec (5,09 MB/sec), 3,7 ms avg latency, 95,0 ms max latency.
1350 records sent, 266,7 records/sec (5,09 MB/sec), 3,7 ms avg latency, 90,0 ms max latency.
1259 records sent, 246,6 records/sec (4,70 MB/sec), 4,0 ms avg latency, 180,0 ms max latency.
1291 records sent, 257,1 records/sec (4,90 MB/sec), 3,9 ms avg latency, 90,0 ms max latency.
1275 records sent, 254,9 records/sec (4,86 MB/sec), 3,9 ms avg latency, 175,0 ms max latency.
1350 records sent, 266,9 records/sec (5,09 MB/sec), 3,7 ms avg latency, 94,0 ms max latency.
1350 records sent, 266,7 records/sec (5,09 MB/sec), 3,7 ms avg latency, 92,0 ms max latency.
1350 records sent, 267,2 records/sec (5,10 MB/sec), 3,7 ms avg latency, 93,0 ms max latency.
1350 records sent, 267,0 records/sec (5,09 MB/sec), 3,7 ms avg latency, 94,0 ms max latency.
1325 records sent, 261,8 records/sec (4,99 MB/sec), 3,8 ms avg latency, 90,0 ms max latency.
1349 records sent, 269,5 records/sec (5,14 MB/sec), 3,7 ms avg latency, 91,0 ms max latency.
1326 records sent, 263,5 records/sec (5,03 MB/sec), 3,8 ms avg latency, 93,0 ms max latency.
1325 records sent, 265,0 records/sec (5,05 MB/sec), 3,8 ms avg latency, 92,0 ms max latency.
1350 records sent, 266,9 records/sec (5,09 MB/sec), 3,7 ms avg latency, 92,0 ms max latency.
1350 records sent, 266,7 records/sec (5,09 MB/sec), 3,7 ms avg latency, 91,0 ms max latency.
1350 records sent, 267,2 records/sec (5,10 MB/sec), 3,7 ms avg latency, 93,0 ms max latency.
1050 records sent, 209,2 records/sec (3,99 MB/sec), 4,8 ms avg latency, 244,0 ms max latency.
1350 records sent, 266,9 records/sec (5,09 MB/sec), 3,7 ms avg latency, 94,0 ms max latency.
1350 records sent, 267,2 records/sec (5,10 MB/sec), 3,7 ms avg latency, 91,0 ms max latency.
1350 records sent, 267,1 records/sec (5,09 MB/sec), 3,7 ms avg latency, 92,0 ms max latency.
1350 records sent, 266,5 records/sec (5,08 MB/sec), 3,7 ms avg latency, 97,0 ms max latency.
1275 records sent, 252,9 records/sec (4,82 MB/sec), 3,9 ms avg latency, 259,0 ms max latency.
1350 records sent, 267,3 records/sec (5,10 MB/sec), 3,7 ms avg latency, 94,0 ms max latency.
1325 records sent, 261,8 records/sec (4,99 MB/sec), 3,8 ms avg latency, 90,0 ms max latency.
1350 records sent, 267,2 records/sec (5,10 MB/sec), 3,7 ms avg latency, 90,0 ms max latency.
1350 records sent, 267,4 records/sec (5,10 MB/sec), 3,7 ms avg latency, 95,0 ms max latency.
1350 records sent, 267,6 records/sec (5,10 MB/sec), 3,7 ms avg latency, 90,0 ms max latency.
1300 records sent, 259,3 records/sec (4,95 MB/sec), 3,8 ms avg latency, 157,0 ms max latency.
1350 records sent, 266,9 records/sec (5,09 MB/sec), 3,7 ms avg latency, 90,0 ms max latency.
1350 records sent, 266,6 records/sec (5,08 MB/sec), 3,7 ms avg latency, 90,0 ms max latency.
1300 records sent, 258,2 records/sec (4,92 MB/sec), 3,9 ms avg latency, 164,0 ms max latency.
1350 records sent, 267,0 records/sec (5,09 MB/sec), 3,7 ms avg latency, 94,0 ms max latency.
80000 records sent, 261,773252 records/sec (4,99 MB/sec), 3,80 ms avg latency, 3552,00 ms max latency, 0 ms 50th, 7 ms 95th, 89 ms 99th, 91 ms 99.9th.

Metric Name                                                                          Value
app-info:commit-id:{client-id=producer-1}                                          : d4284cbebb6f0a4c
app-info:start-time-ms:{client-id=producer-1}                                      : 1590700913910
app-info:version:{client-id=producer-1}                                            : 2.3.1
kafka-metrics-count:count:{client-id=producer-1}                                   : 126,000
producer-metrics:batch-size-avg:{client-id=producer-1}                             : 20077,000
producer-metrics:batch-size-max:{client-id=producer-1}                             : 20077,000
producer-metrics:batch-split-rate:{client-id=producer-1}                           : 0,000
producer-metrics:batch-split-total:{client-id=producer-1}                          : 0,000
producer-metrics:buffer-available-bytes:{client-id=producer-1}                     : 33554432,000
producer-metrics:buffer-exhausted-rate:{client-id=producer-1}                      : 0,000
producer-metrics:buffer-exhausted-total:{client-id=producer-1}                     : 0,000
producer-metrics:buffer-total-bytes:{client-id=producer-1}                         : 33554432,000
producer-metrics:bufferpool-wait-ratio:{client-id=producer-1}                      : 0,000
producer-metrics:bufferpool-wait-time-total:{client-id=producer-1}                 : 0,000
producer-metrics:compression-rate-avg:{client-id=producer-1}                       : 1,000
producer-metrics:connection-close-rate:{client-id=producer-1}                      : 0,000
producer-metrics:connection-close-total:{client-id=producer-1}                     : 0,000
producer-metrics:connection-count:{client-id=producer-1}                           : 4,000
producer-metrics:connection-creation-rate:{client-id=producer-1}                   : 0,000
producer-metrics:connection-creation-total:{client-id=producer-1}                  : 4,000
producer-metrics:failed-authentication-rate:{client-id=producer-1}                 : 0,000
producer-metrics:failed-authentication-total:{client-id=producer-1}                : 0,000
producer-metrics:failed-reauthentication-rate:{client-id=producer-1}               : 0,000
producer-metrics:failed-reauthentication-total:{client-id=producer-1}              : 0,000
producer-metrics:incoming-byte-rate:{client-id=producer-1}                         : 8,056
producer-metrics:incoming-byte-total:{client-id=producer-1}                        : 1746,000
producer-metrics:io-ratio:{client-id=producer-1}                                   : 0,008
producer-metrics:io-time-ns-avg:{client-id=producer-1}                             : 15600,800
producer-metrics:io-wait-ratio:{client-id=producer-1}                              : 0,970
producer-metrics:io-wait-time-ns-avg:{client-id=producer-1}                        : 1852011,462
producer-metrics:io-waittime-total:{client-id=producer-1}                          : 294122265455,000
producer-metrics:iotime-total:{client-id=producer-1}                               : 2638275459,000
producer-metrics:metadata-age:{client-id=producer-1}                               : 5,372
producer-metrics:network-io-rate:{client-id=producer-1}                            : 264,989
producer-metrics:network-io-total:{client-id=producer-1}                           : 80012,000
producer-metrics:outgoing-byte-rate:{client-id=producer-1}                         : 5342218,193
producer-metrics:outgoing-byte-total:{client-id=producer-1}                        : 1612549072,000
producer-metrics:produce-throttle-time-avg:{client-id=producer-1}                  : 0,000
producer-metrics:produce-throttle-time-max:{client-id=producer-1}                  : 0,000
producer-metrics:reauthentication-latency-avg:{client-id=producer-1}               : NaN
producer-metrics:reauthentication-latency-max:{client-id=producer-1}               : NaN
producer-metrics:record-error-rate:{client-id=producer-1}                          : 0,000
producer-metrics:record-error-total:{client-id=producer-1}                         : 0,000
producer-metrics:record-queue-time-avg:{client-id=producer-1}                      : 0,026
producer-metrics:record-queue-time-max:{client-id=producer-1}                      : 5,000
producer-metrics:record-retry-rate:{client-id=producer-1}                          : 0,000
producer-metrics:record-retry-total:{client-id=producer-1}                         : 0,000
producer-metrics:record-send-rate:{client-id=producer-1}                           : 264,998
producer-metrics:record-send-total:{client-id=producer-1}                          : 80000,000
producer-metrics:record-size-avg:{client-id=producer-1}                            : 20092,000
producer-metrics:record-size-max:{client-id=producer-1}                            : 20092,000
producer-metrics:records-per-request-avg:{client-id=producer-1}                    : 1,000
producer-metrics:request-latency-avg:{client-id=producer-1}                        : NaN
producer-metrics:request-latency-max:{client-id=producer-1}                        : NaN
producer-metrics:request-rate:{client-id=producer-1}                               : 264,961
producer-metrics:request-size-avg:{client-id=producer-1}                           : 20154,837
producer-metrics:request-size-max:{client-id=producer-1}                           : 20157,000
producer-metrics:request-total:{client-id=producer-1}                              : 80006,000
producer-metrics:requests-in-flight:{client-id=producer-1}                         : 0,000
producer-metrics:response-rate:{client-id=producer-1}                              : 0,028
producer-metrics:response-total:{client-id=producer-1}                             : 6,000
producer-metrics:select-rate:{client-id=producer-1}                                : 524,049
producer-metrics:select-total:{client-id=producer-1}                               : 153133,000
producer-metrics:successful-authentication-no-reauth-total:{client-id=producer-1}  : 0,000
producer-metrics:successful-authentication-rate:{client-id=producer-1}             : 0,000
producer-metrics:successful-authentication-total:{client-id=producer-1}            : 0,000
producer-metrics:successful-reauthentication-rate:{client-id=producer-1}           : 0,000
producer-metrics:successful-reauthentication-total:{client-id=producer-1}          : 0,000
producer-metrics:waiting-threads:{client-id=producer-1}                            : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node--2}   : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-1}    : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-3}    : 8,055
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-6}    : 0,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node--2}  : 579,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-1}   : 294,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-3}   : 579,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-6}   : 294,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node--2}   : 0,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-1}    : 1794801,370
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-3}    : 1800978,220
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-6}    : 1748510,576
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node--2}  : 67,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-1}   : 537986660,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-3}   : 539478196,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-6}   : 535084149,000
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node--2}  : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-1}   : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-3}   : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-6}   : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node--2}  : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-1}   : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-3}   : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-6}   : NaN
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node--2}         : 0,000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-1}          : 89,013
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-3}          : 89,345
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-6}          : 86,715
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node--2}     : NaN
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-1}      : 20157,000
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-3}      : 20150,568
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-6}      : 20157,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node--2}     : NaN
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-1}      : 20157,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-3}      : 20157,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-6}      : 20157,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node--2}        : 2,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-1}         : 26691,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-3}         : 26766,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-6}         : 26547,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node--2}        : 0,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-1}         : 0,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-3}         : 0,028
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-6}         : 0,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node--2}       : 2,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-1}        : 1,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-3}        : 2,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-6}        : 1,000
producer-topic-metrics:byte-rate:{client-id=producer-1, topic=test-topic}          : 5319292,033
producer-topic-metrics:byte-total:{client-id=producer-1, topic=test-topic}         : 1606148890,000
producer-topic-metrics:compression-rate:{client-id=producer-1, topic=test-topic}   : 1,000
producer-topic-metrics:record-error-rate:{client-id=producer-1, topic=test-topic}  : 0,000
producer-topic-metrics:record-error-total:{client-id=producer-1, topic=test-topic} : 0,000
producer-topic-metrics:record-retry-rate:{client-id=producer-1, topic=test-topic}  : 0,000
producer-topic-metrics:record-retry-total:{client-id=producer-1, topic=test-topic} : 0,000
producer-topic-metrics:record-send-rate:{client-id=producer-1, topic=test-topic}   : 264,998
producer-topic-metrics:record-send-total:{client-id=producer-1, topic=test-topic}  : 80000,000
Produce Time: 305.607
[18:26:59] Ignite node stopped OK [uptime=00:05:02.546]
Aplication time: 306.444